[{
    "version": "0.0.20",
    "date": "2025-10-17",
    "changes": [
      "Show the chosen start date in bank holiday auto-fill messages and clarify when earlier bank holidays have already passed."
    ]
  },
  {
    "version": "0.0.19",
    "date": "2025-10-16",
    "changes": [
      "Show the Standard week accrual card at the leave start and surface the remaining accrued leave after a proposed request."
    ]
  },
  {
    "version": "0.0.17",
    "date": "2025-10-15",
    "changes": [
      "Clearly label the Standard week accrual settings as optional and keep the monthly rate editable while typing.",
      "Pre-fill the Standard week bank holidays field with the current working year total, still allowing manual overrides."
    ]
  },
  {
    "version": "0.0.16",
    "date": "2025-10-15",
    "changes": [
      "Leave start date inputs now begin empty so new users can enter the correct join date themselves."
    ]
  },
  {
    "version": "0.0.15",
    "date": "2025-10-16",
    "changes": [
      "Default the organisational working year to run from 1 April to 31 March for new users."
    ]
  },
  {
    "version": "0.0.14",
    "date": "2025-10-15",
    "changes": [
      "Clarify that the Standard week start date is optional for mid-year joiners and rename the remaining balance label.",
      "Automatically pro-rate the Standard week core allowance for mid-year joiners when a start date is supplied."
    ]
  },
  {
    "version": "0.0.13",
    "date": "2025-10-15",
    "changes": [
      "Add a Print to PDF card to the Standard week calculator so you can export those allowances."
    ]
  },
  {
    "version": "0.0.12",
    "date": "2025-10-16",
    "changes": [
      "Default the monthly accrual rate to core plus long service leave divided by 12 while keeping the field editable.",
      "Highlight whether a proposed leave period is covered by the remaining allowance, including half-day end support and a field for leave already taken."
    ]
  },
  {
    "version": "0.0.11",
    "date": "2025-10-15",
    "changes": [
      "Swap the accrual application chooser for a dropdown so it is easier to use on phones.",
      "List the bank holidays that fall within the proposed leave period instead of only showing the count."
    ]
  },
  {
    "version": "0.0.10",
    "date": "2025-10-14",
    "changes": [
      "Let you override the auto-calculated organisational working year end date directly from Settings.",
      "Add a Standard week view with annual leave inputs, monthly accrual options, and a leave period planner that accounts for bank holidays."
    ]
  },
  {
    "version": "0.0.9",
    "date": "2025-10-13",
    "changes": [
      "Let you configure the organisational working year and show the selected range across the bank holiday tools.",
      "Make the standard, 4-day week, and 9-day fortnight hour conversions configurable from Settings.",
      "Automatically work out the standard, 4-day week, and 9-day fortnight defaults from your weekly hours and explain the formulas used.",
      "Clarify Bank Holidays copy to highlight the organisational working year beneath the selector.",
      "Swap the default compressed-day hours so 4-day weeks use 8.22 hours and 9-day fortnights use 9.25 hours.",
      "Ensure the organisational working year ends exactly one year minus one day after the selected start date."
    ]
  },
  {
    "version": "0.0.8",
    "date": "2025-10-13",
    "changes": [
      "Group the Bank Holidays view by financial year so each option spans 1 April to 31 March."
    ]
  },
  {
    "version": "0.0.7",
    "date": "2025-10-12",
    "changes": [
      "Hide the Bank holiday booker section in PDF exports until the required selections are filled in.",
      "Left-align the empty Bank holiday booker list messages in PDF exports for easier reading."
    ]
  },
  {
    "version": "0.0.6",
    "date": "2025-10-12",
    "changes": [
      "Move the Print to PDF button beneath its description on larger screens so it aligns with the card content."
    ]
  },
  {
    "version": "0.0.5",
    "date": "2025-10-12",
    "changes": [
      "Start the Bank holiday booker sections on a new page when printing so no content is clipped"
    ]
  },
  {
    "version": "0.0.3",
    "date": "2025-10-12",
    "changes": [
      "Add print-to-PDF reports for the 4-day week and 9-day fortnight calculators, including bank holiday booker details in the export",
      "Move the print controls into dedicated report cards and generate PDFs in-page so pop-up blockers no longer interfere",
      "Remove browser header and footer details from exported PDFs so reports focus solely on calculator content"
    ]
  },
  {
    "version": "0.0.2",
    "date": "2025-10-12",
    "changes": [
      "Refresh the welcome page copy to highlight the compressed-week calculators",
      "Expand the README with details about the 4-day week and 9-day fortnight tools"
    ]
  },
  {
    "version": "0.0.1",
    "date": "2025-10-11",
    "changes": [
      "Add initial 4-day week page",
      "Add initial 9-day fortnight page"
    ]
  },
  {
    "version": "0.0.0",
    "date": "2025-10-11",
    "changes": [
      "Create base Progressive Web app."
    ]
  }
]
